org/module-of-front-end.org
#+SETUPFILE: ../theme-rose.setup
#+DATE: <2020-01-19 Sun 19:49>
#+TITLE: Module Of Front End

** 序言

1995 年 5 月， Brendan Eich 只用了 10 天，就设计完成了 JavaScript 的第一版，so 对于 JavaScript 的规范化，不要要求太多，比如，它早期根本没有考虑模块化……

随着 web2.0 的发展， Ajax 技术得到广泛应用，各种前端库层出不穷， _前端代码日益膨胀_ ， JavaScript 极其简单的代码组织规范已经 hold 不住如此庞大规模的代码了。

下面一起来看一下， JavaScript 模块化规范的血泪历程！

** 模块化的基础[fn:3]

_1. 函数封装_

最开始的模块就是在一个文件里面编写几个相关的函数，如此用时加载函数所在文件，直接调用即可。

#+BEGIN_SRC js -n
  function fn1() {
      // ....
  }

  function fn2() {
      // ....
  }
#+END_SRC

_缺点_ ：污染了全局变量，容易引起命名冲突，而且模块成员之间没什么关系。

_2. 对象封装_

为了解决上述问题，可以把所有的模块成员封装在一个对象中。如下：

#+BEGIN_SRC js -n
  var moduleInObj = {
      var1: 'Tom',
      var2: 'Jerry',

      fn1: function() {
          // ....
      },
      fn2: function() {
          // ....
      }
  }
#+END_SRC

如此，在需要模块时，引用包含模块的文件，通过 =对象名.模块名= 调用即可。

_缺点_ ：外部可以随意修改内部成员，如 =moduleInObj.var2 = 'Bach'= 或 =moduleInObj.fn2 = function() { //....}= ，不安全啊。

_3. 立即执行函数封装_

为了隐藏细节，可以使用立即执行函数，如下：

#+BEGIN_SRC js -n
  var moduleInIIEF = (function() {
      var var1 = 'Tom';
      var var2 = 'Jerry';

      function fn1() {
          // ....
      }

      function fn2() {
          // ....
      }

      // 只暴露想要暴露的变量或函数
      return {
          var1: var1,
          fn2: fn2
      }
  })
#+END_SRC

如此，在模块外部无法修改没有暴露出来的变量、函数。

_总结_

上述做法就是模块化的基础了，现在，让我们来看一下当前通行的 JavaScript 模块规范。

** 服务器端模块化

*** CommonJS

CommonJS 是 NodeJS 在服务端的模块化规范：
- 一个单独的文件就是一个模块，每个模块都是一个独立的作用域；
- 模块只有一个出口 -- =module.exports= 对象，把模块需要暴露的内容放入该对象；
- 加载模块使用 =require= 方法，该方法读取一个文件并执行，返回文件内部的 =module.exports= 对象。

#+BEGIN_SRC js -n
  // moduleInCommonJS.js

  var var1 = 'Tom';
  var var2 = 'Jerry';

  function fn1() {
      // ....
  }

  function fn2() {
      // ....
  }

  // 通过 module.exports 对象暴露模块内容
  module.exports = {
      fn1: fn1,
      fn2: fn2
  }
#+END_SRC

如此，当需要使用模块功能时，如下操作：

#+BEGIN_SRC js -n
  // 使用 require 加载 moduleInCommonJS
  var moudleInCommonJS = require('./moduleInCommonJS.js');

  // 调用模块的函数
  moduleInCommonJS.fn1();
#+END_SRC

注意，不同的实现对 =require= 时的路径有不同要求，通常可以省略 =.js= 扩展名，可以使用相对路径，也可以使用绝对路径。对于系统内置模块，甚至可以不写路径，直接使用模块名。

CommonJS 中的 =require= 加载是 _同步的_ ，模块系统需要 _同步读取_ 模块文件的内容（服务端内的硬盘读写速度很快），并编译执行以得到模块接口。

然而，浏览器端就尴尬了 -_||

*** NodeJS 如何实现不同模块可以使用相同的变量名[fn:2]

JavaScript 语言本身并没有一种机制来保证不同的模块可以使用相同的变量名，那么 Node.js 是如何实现这一点的呢？

*！！！闭包！！！*

JavaScript 是一种函数式编程语言，它支持闭包 -- 把一段 JS 代码用一个函数包装起来，这段代码的所有“全局”变量就变成了函数内部的局部变量。

如我们编写的 =hello.js= 代码如下：

#+BEGIN_SRC js -n
  var s = 'Hello'
  var name = 'world'

  console.log(s + ' ' + name + '!')
#+END_SRC

↓↓↓ Node.js 加载了 =hello.js= 后，会把代码包装一下再执行，如下：

#+BEGIN_SRC js -n
  (function () {
      // 读取的 hello.js 代码
      var s = 'Hello'
      var name = 'world'

      console.log(s + ' ' + name + '!')
      // hello.js 代码结束
  })()
#+END_SRC

如此以来，原来的全局变量 =s= 现在变成了匿名函数内部的局部变量。

