public/module-of-front-end.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-06-15 Mon 15:54 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Module Of Front End</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jack Liu">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" href="/css/animate.min.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Module Of Front End</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org70e5c02">序言</a></li>
<li><a href="#org84e18b8">模块化的基础</a></li>
<li><a href="#orge946385">服务器端模块化</a>
<ul>
<li><a href="#org7722d27">CommonJS</a></li>
<li><a href="#orgae45937">NodeJS 如何实现不同模块可以使用相同的变量名</a></li>
<li><a href="#org8f44198">模块的输出 module.exports 如何实现</a></li>
<li><a href="#org0057af5">exports 和 module.exports 的异同</a></li>
</ul>
</li>
<li><a href="#org76a4c91">浏览器端模块化</a>
<ul>
<li><a href="#org24f8592">AMD·RequireJS</a></li>
<li><a href="#orgbbfb0d7">CMD·SeaJS</a></li>
</ul>
</li>
<li><a href="#orgef45211">ES6 模块化</a></li>
<li><a href="#org4cee149">总结</a></li>
</ul>
</div>
</div>

<div id="outline-container-org70e5c02" class="outline-2">
<h2 id="org70e5c02">序言</h2>
<div class="outline-text-2" id="text-org70e5c02">
<p>
1995 年 5 月， Brendan Eich 只用了 10 天，就设计完成了 JavaScript 的第一版，so 对于 JavaScript 的规范化，不要要求太多，比如，它早期根本没有考虑模块化……
</p>

<p>
随着 web2.0 的发展， Ajax 技术得到广泛应用，各种前端库层出不穷， <span class="underline">前端代码日益膨胀</span> ， JavaScript 极其简单的代码组织规范已经 hold 不住如此庞大规模的代码了。
</p>

<p>
下面一起来看一下， JavaScript 模块化规范的血泪历程！
</p>
</div>
</div>

<div id="outline-container-org84e18b8" class="outline-2">
<h2 id="org84e18b8">模块化的基础<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></h2>
<div class="outline-text-2" id="text-org84e18b8">
<p>
<span class="underline">1. 函数封装</span>
</p>

<p>
最开始的模块就是在一个文件里面编写几个相关的函数，如此用时加载函数所在文件，直接调用即可。
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #FF1493;">function</span> <span style="color: #87D700;">fn1</span><span style="color: #AF87FF;">()</span> <span style="color: #AF87FF;">{</span>
<span class="linenr">2: </span>    <span style="color: #8B8878;">// </span><span style="color: #8B8878;">....</span>
<span class="linenr">3: </span><span style="color: #AF87FF;">}</span>
<span class="linenr">4: </span>
<span class="linenr">5: </span><span style="color: #FF1493;">function</span> <span style="color: #87D700;">fn2</span><span style="color: #AF87FF;">()</span> <span style="color: #AF87FF;">{</span>
<span class="linenr">6: </span>    <span style="color: #8B8878;">// </span><span style="color: #8B8878;">....</span>
<span class="linenr">7: </span><span style="color: #AF87FF;">}</span>
</pre>
</div>

<p>
<span class="underline">缺点</span> ：污染了全局变量，容易引起命名冲突，而且模块成员之间没什么关系。
</p>

<p>
<span class="underline">2. 对象封装</span>
</p>

<p>
为了解决上述问题，可以把所有的模块成员封装在一个对象中。如下：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #FF1493;">var</span> <span style="color: #FF8C00;">moduleInObj</span> = <span style="color: #AF87FF;">{</span>
<span class="linenr"> 2: </span>    var1: <span style="color: #CDC673;">'Tom'</span>,
<span class="linenr"> 3: </span>    var2: <span style="color: #CDC673;">'Jerry'</span>,
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>    <span style="color: #87D700;">fn1</span>: <span style="color: #FF1493;">function</span><span style="color: #5FD7FF;">()</span> <span style="color: #5FD7FF;">{</span>
<span class="linenr"> 6: </span>        <span style="color: #8B8878;">// </span><span style="color: #8B8878;">....</span>
<span class="linenr"> 7: </span>    <span style="color: #5FD7FF;">}</span>,
<span class="linenr"> 8: </span>    <span style="color: #87D700;">fn2</span>: <span style="color: #FF1493;">function</span><span style="color: #5FD7FF;">()</span> <span style="color: #5FD7FF;">{</span>
<span class="linenr"> 9: </span>        <span style="color: #8B8878;">// </span><span style="color: #8B8878;">....</span>
<span class="linenr">10: </span>    <span style="color: #5FD7FF;">}</span>
<span class="linenr">11: </span><span style="color: #AF87FF;">}</span>
</pre>
</div>

<p>
如此，在需要模块时，引用包含模块的文件，通过 <code>对象名.模块名</code> 调用即可。
</p>

<p>
<span class="underline">缺点</span> ：外部可以随意修改内部成员，如 <code>moduleInObj.var2 = 'Bach'</code> 或 <code>moduleInObj.fn2 = function() { //....}</code> ，不安全啊。
</p>

<p>
<span class="underline">3. 立即执行函数封装</span>
</p>

<p>
为了隐藏细节，可以使用立即执行函数，如下：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #FF1493;">var</span> <span style="color: #FF8C00;">moduleInIIEF</span> = <span style="color: #AF87FF;">(</span><span style="color: #FF1493;">function</span><span style="color: #5FD7FF;">()</span> <span style="color: #5FD7FF;">{</span>
<span class="linenr"> 2: </span>    <span style="color: #FF1493;">var</span> <span style="color: #FF8C00;">var1</span> = <span style="color: #CDC673;">'Tom'</span>;
<span class="linenr"> 3: </span>    <span style="color: #FF1493;">var</span> <span style="color: #FF8C00;">var2</span> = <span style="color: #CDC673;">'Jerry'</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>    <span style="color: #FF1493;">function</span> <span style="color: #87D700;">fn1</span><span style="color: #87D700;">()</span> <span style="color: #87D700;">{</span>
<span class="linenr"> 6: </span>        <span style="color: #8B8878;">// </span><span style="color: #8B8878;">....</span>
<span class="linenr"> 7: </span>    <span style="color: #87D700;">}</span>
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>    <span style="color: #FF1493;">function</span> <span style="color: #87D700;">fn2</span><span style="color: #87D700;">()</span> <span style="color: #87D700;">{</span>
<span class="linenr">10: </span>        <span style="color: #8B8878;">// </span><span style="color: #8B8878;">....</span>
<span class="linenr">11: </span>    <span style="color: #87D700;">}</span>
<span class="linenr">12: </span>
<span class="linenr">13: </span>    <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#21482;&#26292;&#38706;&#24819;&#35201;&#26292;&#38706;&#30340;&#21464;&#37327;&#25110;&#20989;&#25968;</span>
<span class="linenr">14: </span>    <span style="color: #FF1493;">return</span> <span style="color: #87D700;">{</span>
<span class="linenr">15: </span>        var1: var1,
<span class="linenr">16: </span>        fn2: fn2
<span class="linenr">17: </span>    <span style="color: #87D700;">}</span>
<span class="linenr">18: </span><span style="color: #5FD7FF;">}</span><span style="color: #AF87FF;">)</span>
</pre>
</div>

<p>
如此，在模块外部无法修改没有暴露出来的变量、函数。
</p>

<p>
<span class="underline">总结</span>
</p>

<p>
上述做法就是模块化的基础了，现在，让我们来看一下当前通行的 JavaScript 模块规范。
</p>
</div>
</div>

<div id="outline-container-orge946385" class="outline-2">
<h2 id="orge946385">服务器端模块化</h2>
<div class="outline-text-2" id="text-orge946385">
</div>
<div id="outline-container-org7722d27" class="outline-3">
<h3 id="org7722d27">CommonJS</h3>
<div class="outline-text-3" id="text-org7722d27">
<p>
CommonJS 是 NodeJS 在服务端的模块化规范：
</p>
<ul class="org-ul">
<li>一个单独的文件就是一个模块，每个模块都是一个独立的作用域；</li>
<li>模块只有一个出口 &#x2013; <code>module.exports</code> 对象，把模块需要暴露的内容放入该对象；</li>
<li>加载模块使用 <code>require</code> 方法，该方法读取一个文件并执行，返回文件内部的 <code>module.exports</code> 对象。</li>
</ul>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">moduleInCommonJS.js</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #FF1493;">var</span> <span style="color: #FF8C00;">var1</span> = <span style="color: #CDC673;">'Tom'</span>;
<span class="linenr"> 4: </span><span style="color: #FF1493;">var</span> <span style="color: #FF8C00;">var2</span> = <span style="color: #CDC673;">'Jerry'</span>;
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #FF1493;">function</span> <span style="color: #87D700;">fn1</span><span style="color: #AF87FF;">()</span> <span style="color: #AF87FF;">{</span>
<span class="linenr"> 7: </span>    <span style="color: #8B8878;">// </span><span style="color: #8B8878;">....</span>
<span class="linenr"> 8: </span><span style="color: #AF87FF;">}</span>
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #FF1493;">function</span> <span style="color: #87D700;">fn2</span><span style="color: #AF87FF;">()</span> <span style="color: #AF87FF;">{</span>
<span class="linenr">11: </span>    <span style="color: #8B8878;">// </span><span style="color: #8B8878;">....</span>
<span class="linenr">12: </span><span style="color: #AF87FF;">}</span>
<span class="linenr">13: </span>
<span class="linenr">14: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#36890;&#36807; module.exports &#23545;&#35937;&#26292;&#38706;&#27169;&#22359;&#20869;&#23481;</span>
<span class="linenr">15: </span>module.exports = <span style="color: #AF87FF;">{</span>
<span class="linenr">16: </span>    fn1: fn1,
<span class="linenr">17: </span>    fn2: fn2
<span class="linenr">18: </span><span style="color: #AF87FF;">}</span>
</pre>
</div>

<p>
如此，当需要使用模块功能时，如下操作：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#20351;&#29992; require &#21152;&#36733; moduleInCommonJS</span>
<span class="linenr">2: </span><span style="color: #FF1493;">var</span> <span style="color: #FF8C00;">moudleInCommonJS</span> = require<span style="color: #AF87FF;">(</span><span style="color: #CDC673;">'./moduleInCommonJS.js'</span><span style="color: #AF87FF;">)</span>;
<span class="linenr">3: </span>
<span class="linenr">4: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#35843;&#29992;&#27169;&#22359;&#30340;&#20989;&#25968;</span>
<span class="linenr">5: </span>moduleInCommonJS.fn1<span style="color: #AF87FF;">()</span>;
</pre>
</div>

<p>
注意，不同的实现对 <code>require</code> 时的路径有不同要求，通常可以省略 <code>.js</code> 扩展名，可以使用相对路径，也可以使用绝对路径。对于系统内置模块，甚至可以不写路径，直接使用模块名。
</p>

<p>
CommonJS 中的 <code>require</code> 加载是 <span class="underline">同步的</span> ，模块系统需要 <span class="underline">同步读取</span> 模块文件的内容（服务端内的硬盘读写速度很快），并编译执行以得到模块接口。
</p>

<p>
然而，浏览器端就尴尬了 -_||
</p>
</div>
</div>

<div id="outline-container-orgae45937" class="outline-3">
<h3 id="orgae45937">NodeJS 如何实现不同模块可以使用相同的变量名<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h3>
<div class="outline-text-3" id="text-orgae45937">
<p>
JavaScript 语言本身并没有一种机制来保证不同的模块可以使用相同的变量名，那么 Node.js 是如何实现这一点的呢？
</p>

<p>
<b>！！！闭包！！！</b>
</p>

<p>
JavaScript 是一种函数式编程语言，它支持闭包 &#x2013; 把一段 JS 代码用一个函数包装起来，这段代码的所有“全局”变量就变成了函数内部的局部变量。
</p>

<p>
如我们编写的 <code>hello.js</code> 代码如下：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #FF1493;">var</span> <span style="color: #FF8C00;">s</span> = <span style="color: #CDC673;">'Hello'</span>
<span class="linenr">2: </span><span style="color: #FF1493;">var</span> <span style="color: #FF8C00;">name</span> = <span style="color: #CDC673;">'world'</span>
<span class="linenr">3: </span>
<span class="linenr">4: </span>console.log<span style="color: #AF87FF;">(</span>s + <span style="color: #CDC673;">' '</span> + name + <span style="color: #CDC673;">'!'</span><span style="color: #AF87FF;">)</span>
</pre>
</div>

<p>
↓↓↓ Node.js 加载了 <code>hello.js</code> 后，会把代码包装一下再执行，如下：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #AF87FF;">(</span><span style="color: #FF1493;">function</span> <span style="color: #5FD7FF;">()</span> <span style="color: #5FD7FF;">{</span>
<span class="linenr">2: </span>    <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#35835;&#21462;&#30340; hello.js &#20195;&#30721;</span>
<span class="linenr">3: </span>    <span style="color: #FF1493;">var</span> <span style="color: #FF8C00;">s</span> = <span style="color: #CDC673;">'Hello'</span>
<span class="linenr">4: </span>    <span style="color: #FF1493;">var</span> <span style="color: #FF8C00;">name</span> = <span style="color: #CDC673;">'world'</span>
<span class="linenr">5: </span>
<span class="linenr">6: </span>    console.log<span style="color: #87D700;">(</span>s + <span style="color: #CDC673;">' '</span> + name + <span style="color: #CDC673;">'!'</span><span style="color: #87D700;">)</span>
<span class="linenr">7: </span>    <span style="color: #8B8878;">// </span><span style="color: #8B8878;">hello.js &#20195;&#30721;&#32467;&#26463;</span>
<span class="linenr">8: </span><span style="color: #5FD7FF;">}</span><span style="color: #AF87FF;">)()</span>
</pre>
</div>

<p>
如此以来，原来的全局变量 <code>s</code> 现在变成了匿名函数内部的局部变量。
</p>
</div>
</div>
