org/module-of-front-end.org
*** 模块的输出 module.exports 如何实现

Node 利用 JavaScript 的函数式编程的特性，轻而易举实现了模块的隔离。但是，模块的输出 =module.exports= 怎么实现呢？

首先，Node 可以先准备一个对象 =module= ：

#+BEGIN_SRC js -n
  // 准备 module 对象
  var module = {
      id: 'hello',
      exports: {}
  }

  var load = function(module) {
      // 读取的 hello.js 代码
      function greet(name) {
          console.log('Hello, ' + name + '!')
      }

      module.exports = greet
      // hello.js 代码结束

      return module.exports
  }

  var exported = load(moudle)

  // 保存 module
  save(module, exported)
#+END_SRC

可见，变量 =module= 是 Node 在加载 js 文件之前准备的一个变量，并将其传入加载函数，我们可以直接使用变量 =module= 原因就在于它实际上是函数的一个参数。

#+BEGIN_EXAMPLE
exported →→ load(module) →→ module.exports
↓↓↓
save(module.exported) →→ save(module, module.exports)
#+END_EXAMPLE

Node 会把 =module= 变量保存到某个地方，i.e. Node 保存了所有导入的 =module= ，当我们用 =require()= 获取 module 时，Node 找到对应的 =module= ，并把这个 =module= 的 =exports= 变量返回，这样另一个模块就顺利拿到了模块的输出。

*** exports 和 module.exports 的异同

默认情况下，Node 准备的 =export= 变量和 =module.exports= 变量实际上是同一个变量，并且初始化为空对象 ={}= ，如此你就可以直接往里面加东西，如：

#+BEGIN_SRC js -n
  exports.foo = function() { return 'foo' }
  exports.bar = function() { return 'bar' }

  module.exports.foo = function() { return 'foo' }
  module.exports.bar = function() { return 'bar' }
#+END_SRC

但是，如果我们要输出的是一个函数或数组，那么，只能给 =module.exports= 赋值，如：

#+BEGIN_SRC js -n
  module.exports = function() { return 'foo' }; // ✔
  exports = function() { return 'foo};          // ✘
#+END_SRC

为什么呢？

其实，从 [[*%E6%A8%A1%E5%9D%97%E7%9A%84%E8%BE%93%E5%87%BA module.exports %E5%A6%82%E4%BD%95%E5%AE%9E%E7%8E%B0][模块的输出 module.exports 如何实现 ↑]] 章节的 =load= 加载函数中就可以知道，最终返回的只有 =module.exports= ！ =exports= 不过是指向 =module.exports= ，也就是说， =exports= 的内存地址中的值存储的是指向 =module.exports= 的指针， =module.exports= 中的值才是真正返回的对象。

#+BEGIN_EXAMPLE
  exports → module.exports → {}

  exports ✘ module.exports → otherObjectTwo
  ↓
  otherObjectOne

  // 加载函数返回的只是 module.exports
#+END_EXAMPLE

*！！！推荐始终使用 =module.exports= 这种相对安全的输出方式。*

** 浏览器端模块化

浏览器端，加载 JavaScript 文件的方式，是在文档头部插入 =<script>= 标签，但是脚本标签天生 _异步_ ，传统的 CommonJS 模块在浏览器环境中就变成了 _普通的 =.js= 文件_ -- 即没有避免全局变量污染，也没有解决依赖性。

那么，浏览器端的模块化，到底如何去规范呢？？

解决思路之一：开发一个服务器端组件，对模块代码作静态分析，将 _模块与它的依赖列表_ 一起返回给浏览器端。这需要服务器安装额外的组件，并因此要调整一系列底层架构。

解决思路之二：用一套标准模板来封装模块定义，但是如何定义，如何加载呢？

*** AMD·RequireJS

→ [[https://requirejs.org/][RequireJS]]

AMD（Asynchronous Module Definition）异步模块定义，是一个浏览器端模块化开发的规范，是 RequireJS 在推广过程中对模块定义的规范化产出。

#+BEGIN_QUOTE
注意， AMD 并不是 JavaScript 原生支持，使用 AMD 需要引入对应的库函数 -- RequireJS 。
#+END_QUOTE

RequireJS 主要解决两个问题：模块的 _异步加载_ 和 _依赖性_ 。

_1. 定义模块_

RequireJS 定义了一个全局函数 =define= ，用来定义模块，语法如下：

#+BEGIN_EXAMPLE
  define(id?, dependencies?, factory);
#+END_EXAMPLE

其中：
- =id= ，可选参数，用来定义模块的标识，缺省为脚本文件名；
- =dependencies= ，是一个当前模块依赖的模块名称数组；
- =factory= ，工厂方法，模块初始化要执行的 _函数或对象_ ，如果为函数，它应该只被执行一次；如果是对象，它应该为模块的输出值。

_2. 加载模块_

AMD 推崇 _依赖前置_ ，在定义模块的时候就要声明其依赖的模块。

在页面上使用 =require= 函数加载模块，语法如下：

#+BEGIN_EXAMPLE
  require(dependencies?, callback);
#+END_EXAMPLE

其中， =require()= 函数接受两个参数：
- =dependencies= ，表示所以来的模块数组；
- =callback= ，是一个回调函数，当依赖的模块都加载成功后，被调用。加载的模块会以参数形式传入该函数，从而在回调函数内部就可以使用这些模块。

_3. 示例代码_

来看一个简单的 RequireJS 示例代码。

假设文件的目录架构，如下：

#+BEGIN_EXAMPLE
  Proj
  |
  |-- js
  |   |-- lib
  |       |-- jquery.js
  |       |-- require.js
  |
  |-- index.html
  |-- main.js
#+END_EXAMPLE

在 =index.html= 头部引入 =require.js= 文件，如下：

#+BEGIN_SRC html -n
  <scrpit data-main="./main" src="js/lib/require.js" defer async></scrpit>
#+END_SRC

其中，当 =require.js= 加载的时候会检查 =data-main= 属性，以获取 _入口脚本_ （这里是 =main.js= ）。

编写 =main.js= 即可，如下：

#+BEGIN_SRC js -n
  require.config({
      baseUrl: './js/',
      paths: {
          'jquery': 'lib/jquery'
      }
  });

  require(['jquery'], function($) {
      // jquery → $
      $(document).ready(() => {
          console.log('Hello World.');
      })
  })
#+END_SRC

