public/module-of-front-end.html

<div id="outline-container-org8f44198" class="outline-3">
<h3 id="org8f44198">模块的输出 module.exports 如何实现</h3>
<div class="outline-text-3" id="text-org8f44198">
<p>
Node 利用 JavaScript 的函数式编程的特性，轻而易举实现了模块的隔离。但是，模块的输出 <code>module.exports</code> 怎么实现呢？
</p>

<p>
首先，Node 可以先准备一个对象 <code>module</code> ：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#20934;&#22791; module &#23545;&#35937;</span>
<span class="linenr"> 2: </span><span style="color: #FF1493;">var</span> <span style="color: #FF8C00;">module</span> = <span style="color: #AF87FF;">{</span>
<span class="linenr"> 3: </span>    id: <span style="color: #CDC673;">'hello'</span>,
<span class="linenr"> 4: </span>    exports: <span style="color: #5FD7FF;">{}</span>
<span class="linenr"> 5: </span><span style="color: #AF87FF;">}</span>
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #FF1493;">var</span> <span style="color: #FF8C00;">load</span> = <span style="color: #FF1493;">function</span><span style="color: #AF87FF;">(</span><span style="color: #FF8C00;">module</span><span style="color: #AF87FF;">)</span> <span style="color: #AF87FF;">{</span>
<span class="linenr"> 8: </span>    <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#35835;&#21462;&#30340; hello.js &#20195;&#30721;</span>
<span class="linenr"> 9: </span>    <span style="color: #FF1493;">function</span> <span style="color: #87D700;">greet</span><span style="color: #5FD7FF;">(</span><span style="color: #FF8C00;">name</span><span style="color: #5FD7FF;">)</span> <span style="color: #5FD7FF;">{</span>
<span class="linenr">10: </span>        console.log<span style="color: #87D700;">(</span><span style="color: #CDC673;">'Hello, '</span> + name + <span style="color: #CDC673;">'!'</span><span style="color: #87D700;">)</span>
<span class="linenr">11: </span>    <span style="color: #5FD7FF;">}</span>
<span class="linenr">12: </span>
<span class="linenr">13: </span>    module.exports = greet
<span class="linenr">14: </span>    <span style="color: #8B8878;">// </span><span style="color: #8B8878;">hello.js &#20195;&#30721;&#32467;&#26463;</span>
<span class="linenr">15: </span>
<span class="linenr">16: </span>    <span style="color: #FF1493;">return</span> module.exports
<span class="linenr">17: </span><span style="color: #AF87FF;">}</span>
<span class="linenr">18: </span>
<span class="linenr">19: </span><span style="color: #FF1493;">var</span> <span style="color: #FF8C00;">exported</span> = load<span style="color: #AF87FF;">(</span>moudle<span style="color: #AF87FF;">)</span>
<span class="linenr">20: </span>
<span class="linenr">21: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#20445;&#23384; module</span>
<span class="linenr">22: </span>save<span style="color: #AF87FF;">(</span>module, exported<span style="color: #AF87FF;">)</span>
</pre>
</div>

<p>
可见，变量 <code>module</code> 是 Node 在加载 js 文件之前准备的一个变量，并将其传入加载函数，我们可以直接使用变量 <code>module</code> 原因就在于它实际上是函数的一个参数。
</p>

<pre class="example">
exported →→ load(module) →→ module.exports
↓↓↓
save(module.exported) →→ save(module, module.exports)
</pre>

<p>
Node 会把 <code>module</code> 变量保存到某个地方，i.e. Node 保存了所有导入的 <code>module</code> ，当我们用 <code>require()</code> 获取 module 时，Node 找到对应的 <code>module</code> ，并把这个 <code>module</code> 的 <code>exports</code> 变量返回，这样另一个模块就顺利拿到了模块的输出。
</p>
</div>
</div>

<div id="outline-container-org0057af5" class="outline-3">
<h3 id="org0057af5">exports 和 module.exports 的异同</h3>
<div class="outline-text-3" id="text-org0057af5">
<p>
默认情况下，Node 准备的 <code>export</code> 变量和 <code>module.exports</code> 变量实际上是同一个变量，并且初始化为空对象 <code>{}</code> ，如此你就可以直接往里面加东西，如：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>exports.foo = <span style="color: #FF1493;">function</span><span style="color: #AF87FF;">()</span> <span style="color: #AF87FF;">{</span> <span style="color: #FF1493;">return</span> <span style="color: #CDC673;">'foo'</span> <span style="color: #AF87FF;">}</span>
<span class="linenr">2: </span>exports.bar = <span style="color: #FF1493;">function</span><span style="color: #AF87FF;">()</span> <span style="color: #AF87FF;">{</span> <span style="color: #FF1493;">return</span> <span style="color: #CDC673;">'bar'</span> <span style="color: #AF87FF;">}</span>
<span class="linenr">3: </span>
<span class="linenr">4: </span>module.exports.foo = <span style="color: #FF1493;">function</span><span style="color: #AF87FF;">()</span> <span style="color: #AF87FF;">{</span> <span style="color: #FF1493;">return</span> <span style="color: #CDC673;">'foo'</span> <span style="color: #AF87FF;">}</span>
<span class="linenr">5: </span>module.exports.bar = <span style="color: #FF1493;">function</span><span style="color: #AF87FF;">()</span> <span style="color: #AF87FF;">{</span> <span style="color: #FF1493;">return</span> <span style="color: #CDC673;">'bar'</span> <span style="color: #AF87FF;">}</span>
</pre>
</div>

<p>
但是，如果我们要输出的是一个函数或数组，那么，只能给 <code>module.exports</code> 赋值，如：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>module.exports = <span style="color: #FF1493;">function</span><span style="color: #AF87FF;">()</span> <span style="color: #AF87FF;">{</span> <span style="color: #FF1493;">return</span> <span style="color: #CDC673;">'foo'</span> <span style="color: #AF87FF;">}</span>; <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#10004;</span>
<span class="linenr">2: </span>exports = <span style="color: #FF1493;">function</span><span style="color: #AF87FF;">()</span> <span style="color: #AF87FF;">{</span> <span style="color: #FF1493;">return</span> <span style="color: #CDC673;">'foo};          // &#10008;</span>
</pre>
</div>

<p>
为什么呢？
</p>

<p>
其实，从 <a href="#org8f44198">模块的输出 module.exports 如何实现 ↑</a> 章节的 <code>load</code> 加载函数中就可以知道，最终返回的只有 <code>module.exports</code> ！ <code>exports</code> 不过是指向 <code>module.exports</code> ，也就是说， <code>exports</code> 的内存地址中的值存储的是指向 <code>module.exports</code> 的指针， <code>module.exports</code> 中的值才是真正返回的对象。
</p>

<pre class="example">
exports → module.exports → {}

exports ✘ module.exports → otherObjectTwo
↓
otherObjectOne

// 加载函数返回的只是 module.exports
</pre>

<p>
<b>！！！推荐始终使用 <code>module.exports</code> 这种相对安全的输出方式。</b>
</p>
</div>
</div>
</div>

<div id="outline-container-org76a4c91" class="outline-2">
<h2 id="org76a4c91">浏览器端模块化</h2>
<div class="outline-text-2" id="text-org76a4c91">
<p>
浏览器端，加载 JavaScript 文件的方式，是在文档头部插入 <code>&lt;script&gt;</code> 标签，但是脚本标签天生 <span class="underline">异步</span> ，传统的 CommonJS 模块在浏览器环境中就变成了 <span class="underline">普通的 <code>.js</code> 文件</span> &#x2013; 即没有避免全局变量污染，也没有解决依赖性。
</p>

<p>
那么，浏览器端的模块化，到底如何去规范呢？？
</p>

<p>
解决思路之一：开发一个服务器端组件，对模块代码作静态分析，将 <span class="underline">模块与它的依赖列表</span> 一起返回给浏览器端。这需要服务器安装额外的组件，并因此要调整一系列底层架构。
</p>

<p>
解决思路之二：用一套标准模板来封装模块定义，但是如何定义，如何加载呢？
</p>
</div>

<div id="outline-container-org24f8592" class="outline-3">
<h3 id="org24f8592">AMD·RequireJS</h3>
<div class="outline-text-3" id="text-org24f8592">
<p>
→ <a href="https://requirejs.org/">RequireJS</a>
</p>

<p>
AMD（Asynchronous Module Definition）异步模块定义，是一个浏览器端模块化开发的规范，是 RequireJS 在推广过程中对模块定义的规范化产出。
</p>

<blockquote>
<p>
注意， AMD 并不是 JavaScript 原生支持，使用 AMD 需要引入对应的库函数 &#x2013; RequireJS 。
</p>
</blockquote>

<p>
RequireJS 主要解决两个问题：模块的 <span class="underline">异步加载</span> 和 <span class="underline">依赖性</span> 。
</p>

<p>
<span class="underline">1. 定义模块</span>
</p>

<p>
RequireJS 定义了一个全局函数 <code>define</code> ，用来定义模块，语法如下：
</p>

<pre class="example">
define(id?, dependencies?, factory);
</pre>

<p>
其中：
</p>
<ul class="org-ul">
<li><code>id</code> ，可选参数，用来定义模块的标识，缺省为脚本文件名；</li>
<li><code>dependencies</code> ，是一个当前模块依赖的模块名称数组；</li>
<li><code>factory</code> ，工厂方法，模块初始化要执行的 <span class="underline">函数或对象</span> ，如果为函数，它应该只被执行一次；如果是对象，它应该为模块的输出值。</li>
</ul>

<p>
<span class="underline">2. 加载模块</span>
</p>

<p>
AMD 推崇 <span class="underline">依赖前置</span> ，在定义模块的时候就要声明其依赖的模块。
</p>

<p>
在页面上使用 <code>require</code> 函数加载模块，语法如下：
</p>

<pre class="example">
require(dependencies?, callback);
</pre>

<p>
其中， <code>require()</code> 函数接受两个参数：
</p>
<ul class="org-ul">
<li><code>dependencies</code> ，表示所以来的模块数组；</li>
<li><code>callback</code> ，是一个回调函数，当依赖的模块都加载成功后，被调用。加载的模块会以参数形式传入该函数，从而在回调函数内部就可以使用这些模块。</li>
</ul>

<p>
<span class="underline">3. 示例代码</span>
</p>

<p>
来看一个简单的 RequireJS 示例代码。
</p>

<p>
假设文件的目录架构，如下：
</p>

<pre class="example">
Proj
|
|-- js
|   |-- lib
|       |-- jquery.js
|       |-- require.js
|
|-- index.html
|-- main.js
</pre>

<p>
在 <code>index.html</code> 头部引入 <code>require.js</code> 文件，如下：
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #87D700;">scrpit</span> <span style="color: #FF8C00;">data-main</span>=<span style="color: #CDC673;">"./main"</span> <span style="color: #FF8C00;">src</span>=<span style="color: #CDC673;">"js/lib/require.js"</span> defer async&gt;&lt;/<span style="color: #87D700;">scrpit</span>&gt;
</pre>
</div>

<p>
其中，当 <code>require.js</code> 加载的时候会检查 <code>data-main</code> 属性，以获取 <span class="underline">入口脚本</span> （这里是 <code>main.js</code> ）。
</p>

<p>
编写 <code>main.js</code> 即可，如下：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span>require.config<span style="color: #AF87FF;">(</span><span style="color: #5FD7FF;">{</span>
<span class="linenr"> 2: </span>    baseUrl: <span style="color: #CDC673;">'./js/'</span>,
<span class="linenr"> 3: </span>    paths: <span style="color: #87D700;">{</span>
<span class="linenr"> 4: </span>        <span style="color: #CDC673;">'jquery'</span>: <span style="color: #CDC673;">'lib/jquery'</span>
<span class="linenr"> 5: </span>    <span style="color: #87D700;">}</span>
<span class="linenr"> 6: </span><span style="color: #5FD7FF;">}</span><span style="color: #AF87FF;">)</span>;
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>require<span style="color: #AF87FF;">(</span><span style="color: #5FD7FF;">[</span><span style="color: #CDC673;">'jquery'</span><span style="color: #5FD7FF;">]</span>, <span style="color: #FF1493;">function</span><span style="color: #5FD7FF;">(</span><span style="color: #FF8C00;">$</span><span style="color: #5FD7FF;">)</span> <span style="color: #5FD7FF;">{</span>
<span class="linenr"> 9: </span>    <span style="color: #8B8878;">// </span><span style="color: #8B8878;">jquery &#8594; $</span>
<span class="linenr">10: </span>    $<span style="color: #87D700;">(</span>document<span style="color: #87D700;">)</span>.ready<span style="color: #87D700;">(</span><span style="color: #CDC673;">()</span> =&gt; <span style="color: #CDC673;">{</span>
<span class="linenr">11: </span>        console.log<span style="color: #FF8C00;">(</span><span style="color: #CDC673;">'Hello World.'</span><span style="color: #FF8C00;">)</span>;
<span class="linenr">12: </span>    <span style="color: #CDC673;">}</span><span style="color: #87D700;">)</span>
<span class="linenr">13: </span><span style="color: #5FD7FF;">}</span><span style="color: #AF87FF;">)</span>
</pre>
</div>
</div>
</div>
