org/module-of-front-end.org
*** CMD·SeaJS

→ [[https://seajs.github.io/seajs/docs/][SeaJS]]

CMD（Common Module Definition）通用模块定义，是国内发展出来的浏览器端模块化开发规范，相似， CMD 是 SeaJS 在推广过程中对模块定义的规范化产出。

_1. 定义模块_

SeaJS 也是为了解决模块的依赖性，语法如下：

#+BEGIN_EXAMPLE
define(id?, deps?, factory)
#+END_EXAMPLE

其中， =factory= 接受三个参数 -- =function(require, exports, module)= ，如下：
- 第一个参数 =require(id)= 是一个方法，接受模块标识作为唯一此参数，用来获取其他模块提供的接口；
- 第二个参数 =exports= 是一个对象，用来向外提供模块接口；
- 第三个参数 =module= 是一个对象，上面存储了与当前模块相关联的一些属性和方法。

_2. 加载模块_

CMD 推崇 _就近依赖_ ，只有在用到某个模块的时候再去 =require= 加载。

_3. 示例代码_

来看一个简单的 SeaJS 示例代码：

#+BEGIN_SRC js -n
  // → hello.js
  define(function(require, exports, module) {
      var $ = require('jquery');

      exports.sayHello = function() {
          $('#hello').toogle('slow');
      };
  });
#+END_SRC

通过 SeaJS 来加载使用上面的模块，如下：

#+BEGIN_SRC js -n
  seajs.config({
      alias: {
          'jquery': 'http:/modules.seajs.org/jquery/1.7.2/jquery.js'
      }
  });

  seajs.use(['./hello', 'jquery'], function(hello, $) {
      $('#beautiful-sea').click(hello.sayHello);
  });
#+END_SRC

_4. AMD vs CMD_

AMD 和 CMD 的模块加载都是异步的，最大的区别是对 _依赖模块的执行时机_ 处理不同。

AMD 在加载模块完成后就会执行该模块，所有模块都加载执行完成后，进入 require 的回调函数执行主逻辑。如此，依赖模块的执行顺序和书写顺序便无法保证一致 -- _谁下载快谁先执行_ ，但是主逻辑一定在所有依赖加载完成后才执行。

CMD 加载完某个依赖模块后并不执行，只是下载而已，在所有依赖模块加载完成后进入主逻辑，遇到 require 语句的时候才执行对应的模块，这样模块的执行顺序和书写顺序是完全一致的。

一般来说， AMD 用户体验好，因为没延迟，依赖模块提前执行了； CMD 性能号，因为只有用户需要的时候才执行。

** ES6 模块化[fn:1]

ES6 模块的设计思想是尽量的 _静态化_ ，使得编译时就能确定模块的依赖关系，以及输入和输出的变量。 CommondJS 和 AMD 模块，都只能在运行时确定这些东西。比如， CommonJS 模块就是对象，输入时必须查找对象属性。

_1. ES6 模块的定义和加载_

ES6 的模块化语法： =export= 命令用于规定模块的对外接口， =import= 命令用于输入其他模块提供的功能。如下：

#+BEGIN_SRC js -n
  // 定义模块 math.js
  var basicNum = 0;
  var add = function(a, b) {
      return a + b;
  };

  export {basicNum, add};
#+END_SRC

如需用到该模块，使用 =import= 引用即可，如下：

#+BEGIN_SRC js -n
  // 引用模块
  import { basicNum, add } from './math';

  function test(ele) {
      ele.textContent = add(99 + basicNum);
  }
#+END_SRC

注意，使用 =import= 命令的时候，用户需要知道所要加载的变量名或函数名，否则无法加载。为了给用户提供方便，让他们不用阅读文档就能加载模块，就要用到 =export default= 命令，为模块指定默认输出。

#+BEGIN_SRC js -n
  // export-default.js
  export default function() {
      console.log('Hello World');
  }
#+END_SRC

如此，其他模块加载该模块的时候， =import= 命令可以为该匿名函数指定任意名字，如：

#+BEGIN_SRC js -n
  // import-default.js
  import customName from './export-default';

  customName();                   // → 'Hello World'
#+END_SRC

_2. ES6 模块和 CommonJS 模块的差异_

它们有两个重大差异：
- CommonJS 模块输出的是一个 _值的拷贝_ ，ES6 模块输出的是 _值的引用_ ；
- CommonJS 模块是运行时加载，ES6 模块是编译时输出接口。

来看一个代码示例：

#+BEGIN_SRC js -n
  // lib.js
  export let conuter = 3;
  export function incCounter() {
      counter++;
  }

  // 在 main.js 中加载 lib.js
  import { counter, incCounter } from './lib';

  console.log(counter);           // → 3

  incCounter();
  console.log(counter);           // → 4
#+END_SRC

可见，ES6 模块的运行机制与 CommonJS 不一样。ES6 模块是 _动态引用_ ，并不会缓存值，模块里面的变量绑定其所在的模块。

第二个差异是因为 CommonJS 加载的是一个对象（即 =module.exports= 属性），该对象只有在脚本运行完才会生成；而 ES6 模块不是对象，它的对外接口只是已经静态定义，在代码静态解析阶段就会生成。

** 总结

小结一下：
- CommonJS 规范主要用于服务端编程，加载模块是同步的，并不适合浏览器环境，因为同步意味着阻塞加载，浏览器资源是异步加载的，因此有了 AMD 、CMD 解决方案；
- AMD 规范在浏览器环境中异步加载模块，而且可以并行加载多个模块。不过，AMD 规范开发成本高，代码的阅读和书写比较困难，模块定义方式的语义不顺畅；
- CMD 规范与 AMD 规范很相似，都用于浏览器编程，依赖就近，延迟执行，可以很容易在 Node.js 中运行。但是依赖 SPM 打包，模块的加载逻辑偏重；
- ES6 在语言标准的层面上，实现了模块功能，而且实现得相当简单，完全可以取代 CommonJS 和 AMD 规范，成为浏览器和服务器通用的模块解决方案。

