public/module-of-front-end.html

<div id="outline-container-orgbbfb0d7" class="outline-3">
<h3 id="orgbbfb0d7">CMD·SeaJS</h3>
<div class="outline-text-3" id="text-orgbbfb0d7">
<p>
→ <a href="https://seajs.github.io/seajs/docs/">SeaJS</a>
</p>

<p>
CMD（Common Module Definition）通用模块定义，是国内发展出来的浏览器端模块化开发规范，相似， CMD 是 SeaJS 在推广过程中对模块定义的规范化产出。
</p>

<p>
<span class="underline">1. 定义模块</span>
</p>

<p>
SeaJS 也是为了解决模块的依赖性，语法如下：
</p>

<pre class="example">
define(id?, deps?, factory)
</pre>

<p>
其中， <code>factory</code> 接受三个参数 &#x2013; <code>function(require, exports, module)</code> ，如下：
</p>
<ul class="org-ul">
<li>第一个参数 <code>require(id)</code> 是一个方法，接受模块标识作为唯一此参数，用来获取其他模块提供的接口；</li>
<li>第二个参数 <code>exports</code> 是一个对象，用来向外提供模块接口；</li>
<li>第三个参数 <code>module</code> 是一个对象，上面存储了与当前模块相关联的一些属性和方法。</li>
</ul>

<p>
<span class="underline">2. 加载模块</span>
</p>

<p>
CMD 推崇 <span class="underline">就近依赖</span> ，只有在用到某个模块的时候再去 <code>require</code> 加载。
</p>

<p>
<span class="underline">3. 示例代码</span>
</p>

<p>
来看一个简单的 SeaJS 示例代码：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#8594; hello.js</span>
<span class="linenr">2: </span>define<span style="color: #AF87FF;">(</span><span style="color: #FF1493;">function</span><span style="color: #5FD7FF;">(</span><span style="color: #FF8C00;">require</span>, <span style="color: #FF8C00;">exports</span>, <span style="color: #FF8C00;">module</span><span style="color: #5FD7FF;">)</span> <span style="color: #5FD7FF;">{</span>
<span class="linenr">3: </span>    <span style="color: #FF1493;">var</span> <span style="color: #FF8C00;">$</span> = require<span style="color: #87D700;">(</span><span style="color: #CDC673;">'jquery'</span><span style="color: #87D700;">)</span>;
<span class="linenr">4: </span>
<span class="linenr">5: </span>    exports.sayHello = <span style="color: #FF1493;">function</span><span style="color: #87D700;">()</span> <span style="color: #87D700;">{</span>
<span class="linenr">6: </span>        $<span style="color: #CDC673;">(</span><span style="color: #CDC673;">'#hello'</span><span style="color: #CDC673;">)</span>.toogle<span style="color: #CDC673;">(</span><span style="color: #CDC673;">'slow'</span><span style="color: #CDC673;">)</span>;
<span class="linenr">7: </span>    <span style="color: #87D700;">}</span>;
<span class="linenr">8: </span><span style="color: #5FD7FF;">}</span><span style="color: #AF87FF;">)</span>;
</pre>
</div>

<p>
通过 SeaJS 来加载使用上面的模块，如下：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>seajs.config<span style="color: #AF87FF;">(</span><span style="color: #5FD7FF;">{</span>
<span class="linenr">2: </span>    alias: <span style="color: #87D700;">{</span>
<span class="linenr">3: </span>        <span style="color: #CDC673;">'jquery'</span>: <span style="color: #CDC673;">'http:/modules.seajs.org/jquery/1.7.2/jquery.js'</span>
<span class="linenr">4: </span>    <span style="color: #87D700;">}</span>
<span class="linenr">5: </span><span style="color: #5FD7FF;">}</span><span style="color: #AF87FF;">)</span>;
<span class="linenr">6: </span>
<span class="linenr">7: </span>seajs.use<span style="color: #AF87FF;">(</span><span style="color: #5FD7FF;">[</span><span style="color: #CDC673;">'./hello'</span>, <span style="color: #CDC673;">'jquery'</span><span style="color: #5FD7FF;">]</span>, <span style="color: #FF1493;">function</span><span style="color: #5FD7FF;">(</span><span style="color: #FF8C00;">hello</span>, <span style="color: #FF8C00;">$</span><span style="color: #5FD7FF;">)</span> <span style="color: #5FD7FF;">{</span>
<span class="linenr">8: </span>    $<span style="color: #87D700;">(</span><span style="color: #CDC673;">'#beautiful-sea'</span><span style="color: #87D700;">)</span>.click<span style="color: #87D700;">(</span>hello.sayHello<span style="color: #87D700;">)</span>;
<span class="linenr">9: </span><span style="color: #5FD7FF;">}</span><span style="color: #AF87FF;">)</span>;
</pre>
</div>

<p>
<span class="underline">4. AMD vs CMD</span>
</p>

<p>
AMD 和 CMD 的模块加载都是异步的，最大的区别是对 <span class="underline">依赖模块的执行时机</span> 处理不同。
</p>

<p>
AMD 在加载模块完成后就会执行该模块，所有模块都加载执行完成后，进入 require 的回调函数执行主逻辑。如此，依赖模块的执行顺序和书写顺序便无法保证一致 &#x2013; <span class="underline">谁下载快谁先执行</span> ，但是主逻辑一定在所有依赖加载完成后才执行。
</p>

<p>
CMD 加载完某个依赖模块后并不执行，只是下载而已，在所有依赖模块加载完成后进入主逻辑，遇到 require 语句的时候才执行对应的模块，这样模块的执行顺序和书写顺序是完全一致的。
</p>

<p>
一般来说， AMD 用户体验好，因为没延迟，依赖模块提前执行了； CMD 性能号，因为只有用户需要的时候才执行。
</p>
</div>
</div>
</div>

<div id="outline-container-orgef45211" class="outline-2">
<h2 id="orgef45211">ES6 模块化<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup></h2>
<div class="outline-text-2" id="text-orgef45211">
<p>
ES6 模块的设计思想是尽量的 <span class="underline">静态化</span> ，使得编译时就能确定模块的依赖关系，以及输入和输出的变量。 CommondJS 和 AMD 模块，都只能在运行时确定这些东西。比如， CommonJS 模块就是对象，输入时必须查找对象属性。
</p>

<p>
<span class="underline">1. ES6 模块的定义和加载</span>
</p>

<p>
ES6 的模块化语法： <code>export</code> 命令用于规定模块的对外接口， <code>import</code> 命令用于输入其他模块提供的功能。如下：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#23450;&#20041;&#27169;&#22359; math.js</span>
<span class="linenr">2: </span><span style="color: #FF1493;">var</span> <span style="color: #FF8C00;">basicNum</span> = 0;
<span class="linenr">3: </span><span style="color: #FF1493;">var</span> <span style="color: #FF8C00;">add</span> = <span style="color: #FF1493;">function</span><span style="color: #AF87FF;">(</span><span style="color: #FF8C00;">a</span>, <span style="color: #FF8C00;">b</span><span style="color: #AF87FF;">)</span> <span style="color: #AF87FF;">{</span>
<span class="linenr">4: </span>    <span style="color: #FF1493;">return</span> a + b;
<span class="linenr">5: </span><span style="color: #AF87FF;">}</span>;
<span class="linenr">6: </span>
<span class="linenr">7: </span><span style="color: #FF1493;">export</span> <span style="color: #AF87FF;">{</span>basicNum, add<span style="color: #AF87FF;">}</span>;
</pre>
</div>

<p>
如需用到该模块，使用 <code>import</code> 引用即可，如下：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#24341;&#29992;&#27169;&#22359;</span>
<span class="linenr">2: </span><span style="color: #FF1493;">import</span> <span style="color: #AF87FF;">{</span> basicNum, add <span style="color: #AF87FF;">}</span> from <span style="color: #CDC673;">'./math'</span>;
<span class="linenr">3: </span>
<span class="linenr">4: </span><span style="color: #FF1493;">function</span> <span style="color: #87D700;">test</span><span style="color: #AF87FF;">(</span><span style="color: #FF8C00;">ele</span><span style="color: #AF87FF;">)</span> <span style="color: #AF87FF;">{</span>
<span class="linenr">5: </span>    ele.textContent = add<span style="color: #5FD7FF;">(</span>99 + basicNum<span style="color: #5FD7FF;">)</span>;
<span class="linenr">6: </span><span style="color: #AF87FF;">}</span>
</pre>
</div>

<p>
注意，使用 <code>import</code> 命令的时候，用户需要知道所要加载的变量名或函数名，否则无法加载。为了给用户提供方便，让他们不用阅读文档就能加载模块，就要用到 <code>export default</code> 命令，为模块指定默认输出。
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">export-default.js</span>
<span class="linenr">2: </span><span style="color: #FF1493;">export</span> <span style="color: #FF1493;">default</span> <span style="color: #FF1493;">function</span><span style="color: #AF87FF;">()</span> <span style="color: #AF87FF;">{</span>
<span class="linenr">3: </span>    console.log<span style="color: #5FD7FF;">(</span><span style="color: #CDC673;">'Hello World'</span><span style="color: #5FD7FF;">)</span>;
<span class="linenr">4: </span><span style="color: #AF87FF;">}</span>
</pre>
</div>

<p>
如此，其他模块加载该模块的时候， <code>import</code> 命令可以为该匿名函数指定任意名字，如：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">import-default.js</span>
<span class="linenr">2: </span><span style="color: #FF1493;">import</span> customName from <span style="color: #CDC673;">'./export-default'</span>;
<span class="linenr">3: </span>
<span class="linenr">4: </span>customName<span style="color: #AF87FF;">()</span>;                   <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#8594; 'Hello World'</span>
</pre>
</div>

<p>
<span class="underline">2. ES6 模块和 CommonJS 模块的差异</span>
</p>

<p>
它们有两个重大差异：
</p>
<ul class="org-ul">
<li>CommonJS 模块输出的是一个 <span class="underline">值的拷贝</span> ，ES6 模块输出的是 <span class="underline">值的引用</span> ；</li>
<li>CommonJS 模块是运行时加载，ES6 模块是编译时输出接口。</li>
</ul>

<p>
来看一个代码示例：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">lib.js</span>
<span class="linenr"> 2: </span><span style="color: #FF1493;">export</span> <span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">conuter</span> = 3;
<span class="linenr"> 3: </span><span style="color: #FF1493;">export</span> <span style="color: #FF1493;">function</span> incCounter<span style="color: #AF87FF;">()</span> <span style="color: #AF87FF;">{</span>
<span class="linenr"> 4: </span>    counter++;
<span class="linenr"> 5: </span><span style="color: #AF87FF;">}</span>
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#22312; main.js &#20013;&#21152;&#36733; lib.js</span>
<span class="linenr"> 8: </span><span style="color: #FF1493;">import</span> <span style="color: #AF87FF;">{</span> counter, incCounter <span style="color: #AF87FF;">}</span> from <span style="color: #CDC673;">'./lib'</span>;
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>console.log<span style="color: #AF87FF;">(</span>counter<span style="color: #AF87FF;">)</span>;           <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#8594; 3</span>
<span class="linenr">11: </span>
<span class="linenr">12: </span>incCounter<span style="color: #AF87FF;">()</span>;
<span class="linenr">13: </span>console.log<span style="color: #AF87FF;">(</span>counter<span style="color: #AF87FF;">)</span>;           <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#8594; 4</span>
</pre>
</div>

<p>
可见，ES6 模块的运行机制与 CommonJS 不一样。ES6 模块是 <span class="underline">动态引用</span> ，并不会缓存值，模块里面的变量绑定其所在的模块。
</p>

<p>
第二个差异是因为 CommonJS 加载的是一个对象（即 <code>module.exports</code> 属性），该对象只有在脚本运行完才会生成；而 ES6 模块不是对象，它的对外接口只是已经静态定义，在代码静态解析阶段就会生成。
</p>
</div>
</div>

<div id="outline-container-org4cee149" class="outline-2">
<h2 id="org4cee149">总结</h2>
<div class="outline-text-2" id="text-org4cee149">
<p>
小结一下：
</p>
<ul class="org-ul">
<li>CommonJS 规范主要用于服务端编程，加载模块是同步的，并不适合浏览器环境，因为同步意味着阻塞加载，浏览器资源是异步加载的，因此有了 AMD 、CMD 解决方案；</li>
<li>AMD 规范在浏览器环境中异步加载模块，而且可以并行加载多个模块。不过，AMD 规范开发成本高，代码的阅读和书写比较困难，模块定义方式的语义不顺畅；</li>
<li>CMD 规范与 AMD 规范很相似，都用于浏览器编程，依赖就近，延迟执行，可以很容易在 Node.js 中运行。但是依赖 SPM 打包，模块的加载逻辑偏重；</li>
<li>ES6 在语言标准的层面上，实现了模块功能，而且实现得相当简单，完全可以取代 CommonJS 和 AMD 规范，成为浏览器和服务器通用的模块解决方案。</li>
</ul>
</div>
</div>
